In [1]:
import numpy as np
import pandas as pd

In [3]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates=pd.date_range('20130101',periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [11]:
df

                   A         B         C         D
2013-01-01  1.753379 -0.392738  0.668950  0.499004
2013-01-02  0.471725  1.066724  0.429891  2.585379
2013-01-03  0.758044 -0.287077  0.092497 -1.147985
2013-01-04 -0.691199  0.135198 -3.119589  2.372902
2013-01-05 -1.668033  1.294660  0.778939  0.606872
2013-01-06  0.236205  1.088174 -1.282196 -0.985478

In [12]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(["test","train","test","train"]),
                  'F':'foo'})

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [17]:
df.head()

                   A         B         C         D
2013-01-01  1.753379 -0.392738  0.668950  0.499004
2013-01-02  0.471725  1.066724  0.429891  2.585379
2013-01-03  0.758044 -0.287077  0.092497 -1.147985
2013-01-04 -0.691199  0.135198 -3.119589  2.372902
2013-01-05 -1.668033  1.294660  0.778939  0.606872

In [18]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.691199  0.135198 -3.119589  2.372902
2013-01-05 -1.668033  1.294660  0.778939  0.606872
2013-01-06  0.236205  1.088174 -1.282196 -0.985478

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df.to_numpy()

array([[ 1.75337908, -0.3927385 ,  0.6689498 ,  0.49900418],
       [ 0.47172459,  1.0667242 ,  0.4298907 ,  2.58537917],
       [ 0.75804426, -0.28707683,  0.0924969 , -1.14798499],
       [-0.69119882,  0.13519829, -3.11958855,  2.37290152],
       [-1.66803254,  1.29466021,  0.77893936,  0.60687157],
       [ 0.23620471,  1.08817354, -1.28219602, -0.98547773]])

In [23]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.143354  0.484157 -0.405251  0.655116
std    1.188619  0.754540  1.525653  1.590354
min   -1.668033 -0.392738 -3.119589 -1.147985
25%   -0.459348 -0.181508 -0.938523 -0.614357
50%    0.353965  0.600961  0.261194  0.552938
75%    0.686464  1.082811  0.609185  1.931394
max    1.753379  1.294660  0.778939  2.585379

In [25]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.753379    0.471725    0.758044   -0.691199   -1.668033    0.236205
B   -0.392738    1.066724   -0.287077    0.135198    1.294660    1.088174
C    0.668950    0.429891    0.092497   -3.119589    0.778939   -1.282196
D    0.499004    2.585379   -1.147985    2.372902    0.606872   -0.985478

In [26]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  0.499004  0.668950 -0.392738  1.753379
2013-01-02  2.585379  0.429891  1.066724  0.471725
2013-01-03 -1.147985  0.092497 -0.287077  0.758044
2013-01-04  2.372902 -3.119589  0.135198 -0.691199
2013-01-05  0.606872  0.778939  1.294660 -1.668033
2013-01-06 -0.985478 -1.282196  1.088174  0.236205

In [27]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.753379 -0.392738  0.668950  0.499004
2013-01-03  0.758044 -0.287077  0.092497 -1.147985
2013-01-04 -0.691199  0.135198 -3.119589  2.372902
2013-01-02  0.471725  1.066724  0.429891  2.585379
2013-01-06  0.236205  1.088174 -1.282196 -0.985478
2013-01-05 -1.668033  1.294660  0.778939  0.606872

In [28]:
df['A']

2013-01-01    1.753379
2013-01-02    0.471725
2013-01-03    0.758044
2013-01-04   -0.691199
2013-01-05   -1.668033
2013-01-06    0.236205
Freq: D, Name: A, dtype: float64

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01  1.753379 -0.392738  0.668950  0.499004
2013-01-02  0.471725  1.066724  0.429891  2.585379
2013-01-03  0.758044 -0.287077  0.092497 -1.147985

In [30]:
df.loc[dates[0]]

A    1.753379
B   -0.392738
C    0.668950
D    0.499004
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.753379 -0.392738
2013-01-02  0.471725  1.066724
2013-01-03  0.758044 -0.287077
2013-01-04 -0.691199  0.135198
2013-01-05 -1.668033  1.294660
2013-01-06  0.236205  1.088174

In [32]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.471725  1.066724
2013-01-03  0.758044 -0.287077
2013-01-04 -0.691199  0.135198

In [33]:
df.to_csv('foo.csv')

df2.to_csv('df2.csv')

In [ ]:
### pandas 练习  需到时候用到再查文档